Revit 2027 API
RevisionsOnSheetUIServiceData Class
Note: This API is now obsolete.
 UI data wrapper for RevisionsOnSheetUIService.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.RevisionsOnSheetUIServiceData
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("This is deprecated in Revit 2027 and may be removed in a future version of Revit.")]
public class RevisionsOnSheetUIServiceData : IDisposable
<ObsoleteAttribute("This is deprecated in Revit 2027 and may be removed in a future version of Revit.")>
Public Class RevisionsOnSheetUIServiceData
	Implements IDisposable
[ObsoleteAttribute(L"This is deprecated in Revit 2027 and may be removed in a future version of Revit.")]
public ref class RevisionsOnSheetUIServiceData : IDisposable
[<ObsoleteAttribute("This is deprecated in Revit 2027 and may be removed in a future version of Revit.")>]
type RevisionsOnSheetUIServiceData =
    class
        interface IDisposable
    end
The RevisionsOnSheetUIServiceData type exposes the following members.
Properties
Name | Description
Document |  return the document
IsReset |  flag to indicate the value has been reset
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
ParamId |  the parameter id
Top
Methods
Name | Description
Dispose | Releases all resources used by the RevisionsOnSheetUIServiceData
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetParentHwnd | Obsolete.
 return the parent handle
GetRevitElementIds | Obsolete.
 return the list of revit Element Ids
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.UI Namespace